dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
    wheelL1Odometer_m_prev = wheelL1Odometer_m;
    wheelL2Odometer_m_prev = wheelL2Odometer_m;
    wheelL3Odometer_m_prev = wheelL3Odometer_m;
    wheelR1Odometer_m_prev = wheelR1Odometer_m;
    wheelR2Odometer_m_prev = wheelR2Odometer_m;
    wheelR3Odometer_m_prev = wheelR3Odometer_m;
    mot1CntrPrev = mot1Cntr;
    mot2CntrPrev = mot2Cntr;
    mot3CntrPrev = mot3Cntr;
    mot4CntrPrev = mot4Cntr;
    mot5CntrPrev = mot5Cntr;
    mot6CntrPrev = mot6Cntr;
    
    for (uint8_t i = 0u; i < sizeof(sensors) / sizeof(sensors[0]); i++)
    {
        if (cycleCounter % 10 == 2 * i)
        {
            uint32_t currentTimerCounter = TIM10->CNT;
            uint32_t targetCounter = currentTimerCounter + 2u;  //+2 so the delay is between 10 and 20us
            HAL_GPIO_WritePin(sensors[i].controlPort, sensors[i].controlPin, GPIO_PIN_SET); //SEN1 trigger
            while (TIM10->CNT != targetCounter);
            HAL_GPIO_WritePin(sensors[i].controlPort, sensors[i].controlPin, GPIO_PIN_RESET); //SEN1 trigger
        }
    }

    if (cycleCounter % 4 == 0){
      /* Read Acceleration*/
      float accelerometerBuffer[3];
      BSP_ACCELERO_GetXYZ(accelerometerBuffer);

      accX = accelerometerBuffer[0];
      accY = accelerometerBuffer[1];
      accZ = accelerometerBuffer[2];
      
      accXFiltered = filter2(accXFiltered, accX, 0.2);
      accYFiltered = filter2(accYFiltered, accY, 0.2);
      accZFiltered = filter2(accZFiltered, accZ, 0.2);
     
      fNormAcc = sqrtf((accXFiltered*accXFiltered)+(accYFiltered*accYFiltered)+(accZFiltered*accZFiltered));
        
      fSinRoll = accYFiltered/fNormAcc;
      fCosRoll = sqrtf(1.0-(fSinRoll * fSinRoll));
      fSinPitch = accXFiltered/fNormAcc;
      fCosPitch = sqrtf(1.0-(fSinPitch * fSinPitch));
        
      if ( fSinRoll >0) {
        if (fCosRoll>0) roll = acosf(fCosRoll)*180/M_PI;
        else            roll = acosf(fCosRoll)*180/M_PI + 180;
      }
      else {
        if (fCosRoll>0) roll = acosf(fCosRoll)*180/M_PI + 360;
        else            roll = acosf(fCosRoll)*180/M_PI + 180;
      }
       
      if ( fSinPitch >0) {
        if (fCosPitch>0) pitch = acosf(fCosPitch)*180/M_PI;
        else             pitch = acosf(fCosPitch)*180/M_PI + 180;
      }
      else {
        if (fCosPitch>0) pitch = acosf(fCosPitch)*180/M_PI + 360;
        else             pitch = acosf(fCosPitch)*180/M_PI + 180;
      }

      if (roll >=360)  roll = 360 - roll;
      if (pitch >=360) pitch = 360 - pitch;
      
      /* Read Magnetometer*/
      float compassBuffer[3];
      LSM303DLHC_MagReadXYZ(compassBuffer);
      compassX = compassBuffer[0];
      compassY = compassBuffer[1];
      compassZ = compassBuffer[2];
    }
  }
  /* USER CODE END StartSensorTask */
}

/* USER CODE BEGIN Header_StartControlTask */
/**
* @brief Function implementing the controlTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartControlTask */
void StartControlTask(void const * argument)
{
  /* USER CODE BEGIN StartControlTask */
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    
    reqSpeedLeft = -referenceSpeedLeft;
    reqSpeedRight = referenceSpeedRight;
    
    if (reqSpeedLeft > currSpeedLeft){
      if (reqSpeedLeft > currSpeedLeft + speedRampRate){
        nextSpeedLeft = currSpeedLeft + speedRampRate;
      }
      else{
        nextSpeedLeft = reqSpeedLeft;
      }
    }
    else if (reqSpeedLeft < currSpeedLeft){
      if (reqSpeedLeft < currSpeedLeft - speedRampRate){
        nextSpeedLeft = currSpeedLeft - speedRampRate;
      }
      else{
        nextSpeedLeft = reqSpeedLeft;
      }
    }
    
    if (reqSpeedRight > currSpeedRight){
      if (reqSpeedRight > currSpeedRight + speedRampRate){
        nextSpeedRight = currSpeedRight + speedRampRate;
      }
      else{
        nextSpeedRight = reqSpeedRight;
      }
    }
    else if (reqSpeedRight < currSpeedRight){
      if (reqSpeedRight < currSpeedRight - speedRampRate){
        nextSpeedRight = currSpeedRight - speedRampRate;
      }
      else{
        nextSpeedRight = reqSpeedRight;
      }
    }
    
    wheelL1VelocityErrorBefore = wheelL1VelocityError;
    wheelL1VelocityError = nextSpeedLeft - wheelL1FiltVelocity_mps;
    wheelL1VelocityIntError = wheelL1VelocityIntError + wheelL1VelocityError + antiWindup * (wheelL1SumControl - wheelL1SumControlBeforeSaturation);
    wheelL1VelocityDerivatedError = wheelL1VelocityError - wheelL1VelocityErrorBefore;
    wheelL1SumControl = (int)roundf(ctrlP * wheelL1VelocityError + ctrlI * wheelL1VelocityIntError + ctrlD * wheelL1VelocityDerivatedError);
    wheelL1SumControlBeforeSaturation = wheelL1SumControl;
    
    wheelL2VelocityErrorBefore = wheelL2VelocityError;
    wheelL2VelocityError = nextSpeedLeft - wheelL2FiltVelocity_mps;
    wheelL2VelocityIntError = wheelL2VelocityIntError + wheelL2VelocityError + antiWindup * (wheelL2SumControl - wheelL2SumControlBeforeSaturation);
    wheelL2VelocityDerivatedError = wheelL2VelocityError - wheelL2VelocityErrorBefore;
    wheelL2SumControl = (int)roundf(ctrlP * wheelL2VelocityError + ctrlI * wheelL2VelocityIntError + ctrlD * wheelL2VelocityDerivatedError);
    wheelL2SumControlBeforeSaturation = wheelL2SumControl;
    
    positionErrorL3_deg = referenceAngleL3_deg - wheelL3Angle_deg;
    
    wheelL3VelocityErrorBefore = wheelL3VelocityError;
    wheelL3VelocityError = (positionErrorL3_deg * ctrlP_pos) - wheelL3FiltVelocity_mps;
    wheelL3VelocityIntError = wheelL3VelocityIntError + wheelL3VelocityError + antiWindup * (wheelL3SumControl - wheelL3SumControlBeforeSaturation);
    wheelL3VelocityDerivatedError = wheelL3VelocityError - wheelL3VelocityErrorBefore;
    wheelL3SumControl = (int)roundf(ctrlP * wheelL3VelocityError + ctrlI * wheelL3VelocityIntError + ctrlD * wheelL3VelocityDerivatedError);
    wheelL3SumControlBeforeSaturation = wheelL3SumControl;
    
