dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
    wheelR1VelocityErrorBefore = wheelR1VelocityError;
    wheelR1VelocityError = nextSpeedRight - wheelR1FiltVelocity_mps;
    wheelR1VelocityIntError = wheelR1VelocityIntError + wheelR1VelocityError + antiWindup * (wheelR1SumControl - wheelR1SumControlBeforeSaturation);
    wheelR1VelocityDerivatedError = wheelR1VelocityError - wheelR1VelocityErrorBefore;
    wheelR1SumControl = (int)roundf(ctrlP * wheelR1VelocityError + ctrlI * wheelR1VelocityIntError + ctrlD * wheelR1VelocityDerivatedError);
    wheelR1SumControlBeforeSaturation = wheelR1SumControl;
    
    wheelR2VelocityErrorBefore = wheelR2VelocityError;
    wheelR2VelocityError = nextSpeedRight - wheelR2FiltVelocity_mps;
    wheelR2VelocityIntError = wheelR2VelocityIntError + wheelR2VelocityError + antiWindup * (wheelR2SumControl - wheelR2SumControlBeforeSaturation);
    wheelR2VelocityDerivatedError = wheelR2VelocityError - wheelR2VelocityErrorBefore;
    wheelR2SumControl = (int)roundf(ctrlP * wheelR2VelocityError + ctrlI * wheelR2VelocityIntError + ctrlD * wheelR2VelocityDerivatedError);
    wheelR2SumControlBeforeSaturation = wheelR2SumControl;
    
    wheelR3VelocityErrorBefore = wheelR3VelocityError;
    wheelR3VelocityError = nextSpeedRight - wheelR3FiltVelocity_mps;
    wheelR3VelocityIntError = wheelR3VelocityIntError + wheelR3VelocityError + antiWindup * (wheelR3SumControl - wheelR3SumControlBeforeSaturation);
    wheelR3VelocityDerivatedError = wheelR3VelocityError - wheelR3VelocityErrorBefore;
    wheelR3SumControl = (int)roundf(ctrlP * wheelR3VelocityError + ctrlI * wheelR3VelocityIntError + ctrlD * wheelR3VelocityDerivatedError);
    wheelR3SumControlBeforeSaturation = wheelR3SumControl;
    
    if (fabsf(nextSpeedLeft) < 0.01) {
      wheelL1VelocityIntError -= wheelL1VelocityIntError*0.01;
      wheelL2VelocityIntError -= wheelL2VelocityIntError*0.01;
      wheelL3VelocityIntError -= wheelL3VelocityIntError*0.01;
    }
    if (fabsf(nextSpeedRight) < 0.01) {
      wheelR1VelocityIntError -= wheelR1VelocityIntError*0.01;
      wheelR2VelocityIntError -= wheelR2VelocityIntError*0.01;
      wheelR3VelocityIntError -= wheelR3VelocityIntError*0.01;
    }
    
    wheelL1SumControl = saturateFloat(wheelL1SumControl, -maxDutyCycle, maxDutyCycle);
    wheelL2SumControl = saturateFloat(wheelL2SumControl, -maxDutyCycle, maxDutyCycle);
    wheelL3SumControl = saturateFloat(wheelL3SumControl, -maxDutyCycle, maxDutyCycle);
    wheelR1SumControl = saturateFloat(wheelR1SumControl, -maxDutyCycle, maxDutyCycle);
    wheelR2SumControl = saturateFloat(wheelR2SumControl, -maxDutyCycle, maxDutyCycle);
    wheelR3SumControl = saturateFloat(wheelR3SumControl, -maxDutyCycle, maxDutyCycle);
    
    if (wheelL1SumControl>=0){
      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, GPIO_PIN_SET); //LEFT1 FW
      HAL_GPIO_WritePin(GPIOD, GPIO_PIN_11, GPIO_PIN_RESET); //LEFT1 RW
    }
    else {
      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, GPIO_PIN_RESET); //LEFT1 FW
      HAL_GPIO_WritePin(GPIOD, GPIO_PIN_11, GPIO_PIN_SET); //LEFT1 RW
    }
    TIM1->CCR1 = abs((int)wheelL1SumControl)*4800/100; //LEFT1
    
    if (wheelL2SumControl>=0){
      HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); //LEFT2 FW
      HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, GPIO_PIN_RESET); //LEFT2 RW
    }
    else {
      HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); //LEFT2 FW
      HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, GPIO_PIN_SET); //LEFT2 RW
    }
    TIM1->CCR2 = abs((int)wheelL2SumControl)*4800/100; //LEFT2
    
    if (wheelL3SumControl>=0){
      HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, GPIO_PIN_SET); //LEFT3 FW
      HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11, GPIO_PIN_RESET); //LEFT3 RW
    }
    else {
      HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, GPIO_PIN_RESET); //LEFT3 FW
      HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11, GPIO_PIN_SET); //LEFT3 RW
    }
    TIM1->CCR3 = abs((int)wheelL3SumControl)*4800/100; //LEFT3
    
    if (wheelR1SumControl>=0){
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6,  GPIO_PIN_SET); //RIGHT1 FW
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7,  GPIO_PIN_RESET); //RIGHT1 RW
    }
    else {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6,  GPIO_PIN_RESET); //RIGHT1 FW
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7,  GPIO_PIN_SET); //RIGHT1 RW
    }
    TIM1->CCR4 = abs((int)wheelR1SumControl)*4800/100; //RIGHT1
    
    if (wheelR2SumControl>=0){
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9,  GPIO_PIN_SET); //RIGHT2 FW
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, GPIO_PIN_RESET); //RIGHT2 RW
    }
    else {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9,  GPIO_PIN_RESET); //RIGHT2 FW
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, GPIO_PIN_SET); //RIGHT2 RW
    }
    TIM2->CCR1 = abs((int)wheelR2SumControl)*4800/100; //RIGHT2
    
    if (wheelR2SumControl>=0){
      HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_SET); //RIGHT3 FW
      HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_RESET); //RIGHT3 RW
    }
    else {
      HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12, GPIO_PIN_RESET); //RIGHT3 FW
      HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13, GPIO_PIN_SET); //RIGHT3 RW
    }
    TIM2->CCR3 = abs((int)wheelR3SumControl)*4800/100; //RIGHT3
    
    
    
    currSpeedLeft = nextSpeedLeft;
    currSpeedRight = nextSpeedRight;

    vTaskDelayUntil(&xLastWakeTime, 20u);
  }
  /* USER CODE END StartControlTask */
}

/* USER CODE BEGIN Header_StartCommTask */
/**
* @brief Function implementing the commTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartCommTask */
void StartCommTask(void const * argument)
{
  /* USER CODE BEGIN StartCommTask */
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    HAL_UART_Receive_IT(&huart6,receiveBuffer,5);
    
    if ((receiveBuffer[0] == 0xFF) && (receiveBuffer[1] <=100) && (receiveBuffer[2] <=180)){
      //referenceSpeedOrig = receiveBuffer[1] / 10.0;
      //referenceSpeed = calcSpdRef_LUT(referenceSpeedOrig);
      referenceSpeed = receiveBuffer[1] / 667.0;
      referenceAngle = receiveBuffer[2] * 2.0;
      buttonState = receiveBuffer[3];
      messageCounter = receiveBuffer[4];
      if (messageCounter != messageCounterPrev){
        timeStamp = HAL_GetTick();
        messageCounterPrev = messageCounter;
      }
    }    
    
    timeOutGuard = HAL_GetTick() - timeStamp;
    if (timeOutGuard > timeOutGuardMax){
      timeOutGuardMax = timeOutGuard;
    }
    
    if ((timeOutGuard) > 1000){
      referenceSpeed = 0;
      referenceAngle = 0;
      buttonState = 0;
    }
    
    vTaskDelayUntil(&xLastWakeTime, 20u);
  }
  /* USER CODE END StartCommTask */
}

/* USER CODE BEGIN Header_StartIdleTask */
/**
* @brief Function implementing the idleTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartIdleTask */
void StartIdleTask(void const * argument)
{
  /* USER CODE BEGIN StartIdleTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1000);
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
  }
  /* USER CODE END StartIdleTask */
}

/* USER CODE BEGIN Header_StartLedTask */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLedTask */
void StartLedTask(void const * argument)
{
  /* USER CODE BEGIN StartLedTask */
  uint8_t cycleCounter=0;
  uint32_t roundCounter = 0;
  int8_t bluetoothBlinkCounter = 0;
  int8_t battery1BlinkCounter = 0;
  int8_t battery2BlinkCounter = 0;
  
  float voltageFullRange_Mot = NORMALVOLTAGE_MOT - LOWVOLTAGE_MOT;
  float voltageFullRange_Logic = NORMALVOLTAGE_LOGIC - LOWVOLTAGE_LOGIC;
  float voltageInRange = 0;
  float voltageRatio = 0;
  float cellVoltage = 0;
  
  WS2812_One_RGB(0,(WS2812_RGB_t){0,10,0},0);
  WS2812_One_RGB(1,(WS2812_RGB_t){10,10,10},0);
  WS2812_One_RGB(2,(WS2812_RGB_t){10,0,0},0);
  WS2812_One_RGB(3,(WS2812_RGB_t){10,10,0},0);
  WS2812_One_RGB(4,(WS2812_RGB_t){0,0,10},1);
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    cycleCounter++;
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
    
    if (bumperActive){
      WS2812_All_RGB((WS2812_RGB_t){10,0,0},0);
    }
    else if (ultrasonicActive){
      WS2812_All_RGB((WS2812_RGB_t){0,10,0},0);
    }
    else {
      WS2812_All_RGB((WS2812_RGB_t){0,0,0},0);
      WS2812_One_RGB(((roundCounter%12)+4),(WS2812_RGB_t){0,0,10},0);
      roundCounter++;
      WS2812_Revvy_Shift_Right(0);
    }
    
    
    
