dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
    WS2812_One_RGB(0,(WS2812_RGB_t){30,30,30},0);

    if ((timeOutGuard) > 1000){
      if ((bluetoothBlinkCounter >= 0) && (bluetoothBlinkCounter < 3)) WS2812_One_RGB(1,(WS2812_RGB_t){0,0,30},0);
      else if ((bluetoothBlinkCounter >= 3) && (bluetoothBlinkCounter < 7)) WS2812_One_RGB(1,(WS2812_RGB_t){0,0,0},0);
      if (bluetoothBlinkCounter == 6) bluetoothBlinkCounter = -1;
      bluetoothBlinkCounter++;
    }
    else{
      WS2812_One_RGB(1,(WS2812_RGB_t){0,0,30},0);
    }
    
    cellVoltage = batteryVoltage1 / 4;
    if (cellVoltage >= NORMALVOLTAGE_LOGIC){
      WS2812_One_RGB(2,(WS2812_RGB_t){0,30,0},0);
    }
    else if ((cellVoltage < NORMALVOLTAGE_LOGIC) && (cellVoltage >= LOWVOLTAGE_LOGIC)){
      voltageInRange = cellVoltage - LOWVOLTAGE_LOGIC;
      voltageRatio = voltageInRange / voltageFullRange_Logic;
      WS2812_One_RGB(2,(WS2812_RGB_t){(int)(30*(1-voltageRatio)),(int)(30*(voltageRatio)),0},0);
    }
    else if (cellVoltage < LOWVOLTAGE_LOGIC){
      if (battery1BlinkCounter == 0) WS2812_One_RGB(2,(WS2812_RGB_t){30,0,0},0);
      else if (battery1BlinkCounter == 2) WS2812_One_RGB(2,(WS2812_RGB_t){0,0,0},0);
      else if (battery1BlinkCounter == 4) battery1BlinkCounter = -1;
      battery1BlinkCounter++;
    }
    else {
      WS2812_One_RGB(2,(WS2812_RGB_t){30,30,30},0);
    }
    
    cellVoltage = batteryVoltage2 / 4;
    if (cellVoltage >= NORMALVOLTAGE_MOT){
      WS2812_One_RGB(3,(WS2812_RGB_t){0,30,0},0);
    }
    else if ((cellVoltage < NORMALVOLTAGE_MOT) && (cellVoltage >= LOWVOLTAGE_MOT)){
      voltageInRange = cellVoltage - LOWVOLTAGE_MOT;
      voltageRatio = voltageInRange / voltageFullRange_Mot;
      WS2812_One_RGB(3,(WS2812_RGB_t){(int)(30*(1-voltageRatio)),(int)(30*(voltageRatio)),0},0);
    }
    else if (cellVoltage < LOWVOLTAGE_MOT){
      if (battery2BlinkCounter == 0) WS2812_One_RGB(3,(WS2812_RGB_t){30,0,0},0);
      else if (battery2BlinkCounter == 2) WS2812_One_RGB(3,(WS2812_RGB_t){0,0,0},0);
      else if (battery2BlinkCounter == 4) battery2BlinkCounter = -1;
      battery2BlinkCounter++;
    }
    else {
      WS2812_One_RGB(3,(WS2812_RGB_t){30,30,30},0);
    }
    
    WS2812_Refresh();
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);

    vTaskDelayUntil(&xLastWakeTime, 150u);
  }
  /* USER CODE END StartLedTask */
}

/* USER CODE BEGIN Header_StartApplicationTask */
/**
* @brief Function implementing the applicationTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartApplicationTask */
void StartApplicationTask(void const * argument)
{
  /* USER CODE BEGIN StartApplicationTask */
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    if (autonomousActive){
      referenceAngle = 90;
      referenceSpeed = 0.08;
    }
    
    if (((sensors[0].filteredDistance < 20) && (sensors[0].debounceCounter < ultrasonicDebounceLimit)) 
        || ((sensors[1].filteredDistance < 20) && (sensors[1].debounceCounter < ultrasonicDebounceLimit)) 
        || ((sensors[2].filteredDistance < 20) && (sensors[2].debounceCounter < ultrasonicDebounceLimit)) 
        || ((sensors[3].filteredDistance < 20) && (sensors[3].debounceCounter < ultrasonicDebounceLimit))){
      ultrasonicActive = 1;
      referenceAngle = 180;
      referenceSpeed = 0.1;
    }
    else {
      ultrasonicActive = 0;
    }
    
    
    if ((sen1AnalogValue > 100) || (sen2AnalogValue > 100) || (sen3AnalogValue > 100) || (sen4AnalogValue > 100)){
      bumperActive = 1;
      referenceAngle = 90;
      referenceSpeed = 0.05;
    }
    else {
      bumperActive = 0;
    }
    
    calculateLRSpeeds(referenceSpeed, referenceAngle);
    processButtons(buttonState);

    vTaskDelayUntil(10u);
  }
  /* USER CODE END StartApplicationTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM11 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM11) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  while(1);
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
